src/cf/DataProcessors/ор_ЗагрузкаАналогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ор_ЗагрузкаАналогов</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/АналогиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>АналогиНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ор_Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ор_Обратимость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/DataProcessors/ор_ЗагрузкаАналогов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура - Загрузить аналоги из файла или получить список листов
//
// Параметры:
//  Параметры	 - Структура - структура параметров
//
Процедура ЗагрузитьАналогиИзФайлаИлиПолучитьСписокЛистов(Параметры) Экспорт
	
	ВременныйФайл = ПолучитьИмяВременногоФайла(Параметры.Расширение);
	Параметры.ХранилищеДанных.Записать(ВременныйФайл);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	Попытка
		ТабличныйДокумент.Прочитать(ВременныйФайл);
	Исключение
		
		ОписаниеОшибки = СтрШаблон(НСтр("ru = 'Ошибка чтения табличного документа причине: %1.'"), ОписаниеОшибки());
		
		ИмяСобытия = НСтр("ru = 'Ошибка чтения'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки);
		
		Возврат;
		
	КонецПопытки;
	
	Если Параметры.ЭтоЗаполнениеСпискаЛистов Тогда
		
		Параметры.ВыбранныеЛисты.Очистить();
		
		Для Каждого Лист Из ТабличныйДокумент.Области Цикл
			ЛистДляВыбора = Параметры.ВыбранныеЛисты.Добавить();
			ЛистДляВыбора.Выбран 	= Истина;
			ЛистДляВыбора.ИмяЛиста 	= Лист.Имя;
		КонецЦикла;
		
	Иначе
		ОбработатьФайлExcel(ТабличныйДокумент, Параметры);
	КонецЕсли;
	
	Попытка
		УдалитьФайлы(ВременныйФайл);
	Исключение
		
		ОписаниеОшибки = СтрШаблон(НСтр("ru = 'Ошибка удаление временного файла: %1.'"), ОписаниеОшибки());
		
		ИмяСобытия = НСтр("ru = 'Ошибка удаление временного файла'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки);
		
	КонецПопытки;
	
КонецПроцедуры

// Процедура - Сформировать дерево для отображения
//
// Параметры:
//  Параметры	 - Структура - структура параметров
//
Процедура СформироватьДеревоДляОтображения(Параметры) Экспорт
	
	ФормируемоеДерево = Параметры.ДеревоДляОтображения;
	
	Если Параметры.Свойство("Отбор") Тогда
		Отбор = Параметры.Отбор;
	Иначе
		Отбор = Новый Структура();
	КонецЕсли;
	
	КопияТаблицыЗагрузки = Параметры.ТаблицаЗагрузки.Скопировать();
	КопияТаблицыЗагрузки.Свернуть("МНН");
	
	Для Каждого Строка Из КопияТаблицыЗагрузки Цикл
		
		НовыйУзел = Неопределено;
		
		Отбор.Вставить("МНН", Строка.МНН);
		
		СтрокиСМНН = Параметры.ТаблицаЗагрузки.НайтиСтроки(Отбор);
		Для Каждого СтрокаЗагрузки Из СтрокиСМНН Цикл
			
			Если НовыйУзел = Неопределено Тогда
				НовыйУзел = ФормируемоеДерево.Строки.Добавить();
				НовыйУзел.МНН = СтрокаЗагрузки.МНН;
				НовыйУзел.ЭтоВерхнийУровень = Истина;
				
				СоздатьДочернийУзел(НовыйУзел, СтрокаЗагрузки);
			Иначе
				СоздатьДочернийУзел(НовыйУзел, СтрокаЗагрузки);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура - Найти и заполнить аналоги по текущей номенклатуре
//
// Параметры:
//  СтрокаТЗ	 - СтрокаТаблицыЗначений - строка ТЗ
//  Параметры	 - Структура - структура параметров
//
Процедура НайтиИЗаполнитьАналогиПоТекущейНоменклатуре(СтрокаТЗ, Параметры) Экспорт
	
	Отбор = Новый Структура();
	Отбор.Вставить("МНН", СтрокаТЗ.МНН);
	
	НайденныеАналоги = Параметры.ТаблицаЗагрузки.НайтиСтроки(Отбор);
	
	Для Каждого Строка Из НайденныеАналоги Цикл
		
		Если Не ЗначениеЗаполнено(Строка.Номенклатура)
			Или Строка.Номенклатура = СтрокаТЗ.Номенклатура Тогда
			Продолжить;
		КонецЕсли;
		
		Отбор = Новый Структура();
		Отбор.Вставить("Номенклатура", СтрокаТЗ.Номенклатура);
		Отбор.Вставить("Аналог", Строка.Номенклатура);
		
		УжеСопоставленные = Параметры.СопоставленныеАналоги.НайтиСтроки(Отбор);
		Если УжеСопоставленные.Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Параметры.СопоставленныеАналоги.Добавить();
		НоваяСтрока.Номенклатура 		= СтрокаТЗ.Номенклатура;
		НоваяСтрока.Аналог 				= Строка.Номенклатура;
		НоваяСтрока.ор_Коэффициент 		= 1;
		НоваяСтрока.ор_Обратимость		= Истина;
		НоваяСтрока.Идентичны			= Истина;
		НоваяСтрока.КлючСвязи			= СтрокаТЗ.КлючСвязи;
		НоваяСтрока.МНН					= СтрокаТЗ.МНН;
		НоваяСтрока.Комментарий			= Строка.Комментарий;
		
		ОпределитьСочетаниеВИнформационнойБазе(СтрокаТЗ.Номенклатура, Строка.Номенклатура, НоваяСтрока);
		
		СтрокаТЗ.ЕстьВБазе = НоваяСтрока.ЕстьВБазе;
		
	КонецЦикла;
	
	Отбор = Новый Структура();
	Отбор.Вставить("ЕстьВБазе", 	Истина);
	Отбор.Вставить("Номенклатура", 	СтрокаТЗ.Номенклатура);
	
	ЕстьВБазеТекущая = Параметры.СопоставленныеАналоги.НайтиСтроки(Отбор);
	Если ЕстьВБазеТекущая.Количество() > 0 Тогда
		СтрокаТЗ.ЕстьВБазе = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработатьЛистФайлаExcel(Знач ТабличныйДокумент, ИмяЛиста, Параметры)
	
	КоличествоСтолбцов = ПолучитьФактическоеКоличествоСтолбцов(ТабличныйДокумент);
	
	Лист = ТабличныйДокумент.Области[ИмяЛиста];
	
	Если КоличествоСтолбцов < 2 Тогда
		Возврат;
	КонецЕсли;
	
	НаименованиеПервойКолонки = ТабличныйДокумент.Область("R" + Формат(Лист.Верх, "ЧГ=") + "C" + 1).Текст;
	НаименованиеВторойКолонки = ТабличныйДокумент.Область("R" + Формат(Лист.Верх, "ЧГ=") + "C" + 2).Текст;
	
	Если СтрНайти(ВРег(НаименованиеПервойКолонки), "МНН") = 0
		И СтрНайти(ВРег(НаименованиеВторойКолонки), "МНН") = 0 Тогда
		// попробуем сместиться ниже
		Лист = ТабличныйДокумент.Область(Лист.Верх+1, Лист.Низ, ТабличныйДокумент.ВысотаТаблицы, -КоличествоСтолбцов);
	КонецЕсли;
	
	Построитель = Новый ПостроительЗапроса; 
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(Лист);
	Построитель.ЗаполнитьНастройки();
	Построитель.Выполнить();
	
	ТаблицаИзExcel = Построитель.Результат.Выгрузить();
	
	РазобратьТаблицуПоАлгоритму(ТаблицаИзExcel, Параметры);
	
КонецПроцедуры

Процедура РазобратьТаблицуПоАлгоритму(ТаблицаИзExcel, Параметры)
	
	ТаблицаЗагрузки = Параметры.ТаблицаЗагрузки;
	
	СтрКолонок = СформироватьСтруктуруКолонок(ТаблицаИзExcel);
	
	НоваяСтрока 			= Неопределено;
	ПредыдущийРеферентный 	= "";
	ЛекарственнаяФорма 		= "";
	ПредыдущийМНН 			= "";
	КлючСвязи				= 0;
	МНН						= "";
	
	Для Каждого СтрокаТаблицы Из ТаблицаИзExcel Цикл
		
		Если СтрКолонок.ИмяМНН = Неопределено
			Или СтрКолонок.ИмяТорговоеНаименование = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		// Заполнение торгового наименования
		Если СтрКолонок.ИмяТорговоеНаименование <> Неопределено
			И ЗначениеЗаполнено(СтрокаТаблицы[СтрКолонок.ИмяТорговоеНаименование]) Тогда
			
			МНН = СтрокаТаблицы[СтрКолонок.ИмяМНН];
			
			Если Не ЗначениеЗаполнено(МНН) Тогда
				МНН = ПредыдущийМНН;
			КонецЕсли;
			
			НоваяСтрока = ТаблицаЗагрузки.Добавить();
			НоваяСтрока.МНН = МНН;
			
			НоваяСтрока.ТорговоеНаименование = СокрЛП(СтрокаТаблицы[СтрКолонок.ИмяТорговоеНаименование]);
			
			ПредыдущийМНН = НоваяСтрока.МНН;
			
		КонецЕсли;
		
		Если НоваяСтрока = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		// Заполнение лекарственной формы
		Если СтрКолонок.ИмяЛекарственнаяФорма <> Неопределено
			И ЗначениеЗаполнено(СтрокаТаблицы[СтрКолонок.ИмяЛекарственнаяФорма]) Тогда
			
			ЛекарственнаяФорма = 
				ВРег(Лев(СтрокаТаблицы[СтрКолонок.ИмяЛекарственнаяФорма], 1)) 
				+ Сред(СтрокаТаблицы[СтрКолонок.ИмяЛекарственнаяФорма], 2);
			НоваяСтрока.ЛекарственнаяФорма = ЛекарственнаяФорма;
			
		ИначеЕсли СтрКолонок.ИмяЛекарственнаяФорма <> Неопределено
			И ЗначениеЗаполнено(ЛекарственнаяФорма) Тогда
			
			НоваяСтрока.ЛекарственнаяФорма = ЛекарственнаяФорма;
			
		КонецЕсли;
		
		// Заполнение номер РУ
		Если СтрКолонок.ИмяНомерРУ <> Неопределено
			И ЗначениеЗаполнено(СтрокаТаблицы[СтрКолонок.ИмяНомерРУ]) Тогда
			НоваяСтрока.НомерРУ = СтрокаТаблицы[СтрКолонок.ИмяНомерРУ];
		КонецЕсли;
		
		// Заполнение дата РУ
		Если СтрКолонок.ИмяДатаРУ <> Неопределено 
			И ЗначениеЗаполнено(СтрокаТаблицы[СтрКолонок.ИмяДатаРУ]) Тогда
			НоваяСтрока.ДатаРУ = ОбщегоНазначенияКлиентСервер.СтрокаВДату(СтрокаТаблицы[СтрКолонок.ИмяДатаРУ]);
		КонецЕсли;
		
		// Заполнение комментария
		Если СтрКолонок.ИмяКомментарий <> Неопределено 
			И ЗначениеЗаполнено(СтрокаТаблицы[СтрКолонок.ИмяКомментарий]) Тогда
			НоваяСтрока.Комментарий = СтрокаТаблицы[СтрКолонок.ИмяКомментарий];
		КонецЕсли;
		
		// Заполнение владельца и страны с одной колонки
		Если СтрКолонок.ИмяВладелецРУ_Страна <> Неопределено
			И ЗначениеЗаполнено(СтрокаТаблицы[СтрКолонок.ИмяВладелецРУ_Страна]) Тогда
			
			ВладелецИСтрана = СтрокаТаблицы[СтрКолонок.ИмяВладелецРУ_Страна];
			МассивРазделенный = СтрРазделить(ВладелецИСтрана, ",");
			
			Если МассивРазделенный.Количество() >= 2 Тогда
				НоваяСтрока.Производитель 	= МассивРазделенный[0];
				НоваяСтрока.Страна 		= СокрЛП(МассивРазделенный[1]);
			ИначеЕсли МассивРазделенный.Количество() = 1 Тогда
				НоваяСтрока.Производитель 	= МассивРазделенный[0];
			КонецЕсли;
			
		Иначе
			
			// Заполнение из разных колонок
			Если СтрКолонок.ИмяВладелец <> Неопределено
				И ЗначениеЗаполнено(СтрокаТаблицы[СтрКолонок.ИмяВладелец]) Тогда
				НоваяСтрока.Производитель = СтрокаТаблицы[СтрКолонок.ИмяВладелец];
			КонецЕсли;
			
			Если СтрКолонок.ИмяСтрана <> Неопределено
				И ЗначениеЗаполнено(СтрокаТаблицы[СтрКолонок.ИмяСтрана]) Тогда
				НоваяСтрока.Страна = СтрокаТаблицы[СтрКолонок.ИмяСтрана];
			КонецЕсли;
			
		КонецЕсли;
		
		НужноСопоставление = Истина;
		
		// Заполнение дозировки.
		// В колонке "Дозировка" значений может быть несколько.
		// Следовательно и строк несколько по каждой дозировке.
		Если СтрКолонок.ИмяДозировка <> Неопределено 
			И ЗначениеЗаполнено(СтрокаТаблицы[СтрКолонок.ИмяДозировка]) Тогда
			
			МассивДозировок = СтрРазделить(СтрокаТаблицы[СтрКолонок.ИмяДозировка], ",и");
			Если МассивДозировок.Количество() <= 1 Тогда
				НоваяСтрока.Дозировка = СтрокаТаблицы[СтрКолонок.ИмяДозировка];
				СформироватьФормуВыпускаВСтроке(НоваяСтрока);
				НужноСопоставление = Ложь;
			Иначе
				// значений несколько, создадим еще одну строку с иной дозировкой.
				ЭтоПерваяСтрока = Истина;
				Для Каждого Дозировка Из МассивДозировок Цикл
					Если ЭтоПерваяСтрока Тогда
						НоваяСтрока.Дозировка = СокрЛП(Дозировка);
						СформироватьФормуВыпускаВСтроке(НоваяСтрока);
						НужноСопоставление = Ложь;
						ЭтоПерваяСтрока = Ложь;
						Продолжить;
					КонецЕсли;
					НоваяСтрока2 = ТаблицаЗагрузки.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока2, НоваяСтрока,, "Дозировка, Номенклатура");
					НоваяСтрока2.Дозировка 	= СокрЛП(Дозировка);
					НоваяСтрока2.МНН 		= НоваяСтрока.МНН;
					СформироватьФормуВыпускаВСтроке(НоваяСтрока2);
					НужноСопоставление = Ложь;
				КонецЦикла;
			КонецЕсли;
			
		КонецЕсли;
		
		Если НужноСопоставление Тогда
			СформироватьФормуВыпускаВСтроке(НоваяСтрока);
		КонецЕсли;
		
		// Заполнение реферетного препарата.
		// Если он есть, создается еще один узел для верхнего узла (МНН).
		Если СтрКолонок.ИмяРеферетныйПрепарат <> Неопределено
			И ЗначениеЗаполнено(СтрокаТаблицы[СтрКолонок.ИмяРеферетныйПрепарат])
			И Не СтрокаТаблицы[СтрКолонок.ИмяРеферетныйПрепарат] = ПредыдущийРеферентный Тогда
			
			ТекущийРеферетныйПрепарат = СтрокаТаблицы[СтрКолонок.ИмяРеферетныйПрепарат];
			
			ПредыдущийРеферентный = СтрокаТаблицы[СтрКолонок.ИмяРеферетныйПрепарат];
			
			ОткрывающаяСкобка = 0;
			ЗакрывающаяСкобка = 0;
			
			КлючиЗапрета = Новый Структура();
			КлючиЗапрета.Вставить("ТочкаСЗапятой", 	"$&@");
			КлючиЗапрета.Вставить("Запятая", 		"@&$");
			
			Для Символ = 1 По СтрДлина(СтрокаТаблицы[СтрКолонок.ИмяРеферетныйПрепарат]) Цикл
				
				Если Сред(СтрокаТаблицы[СтрКолонок.ИмяРеферетныйПрепарат], Символ, 1) = "("
					И ОткрывающаяСкобка = 0 Тогда
					ОткрывающаяСкобка = Символ;
				КонецЕсли;
				
				Если Сред(СтрокаТаблицы[СтрКолонок.ИмяРеферетныйПрепарат], Символ, 1) = ")"
					И ОткрывающаяСкобка > 0 Тогда
					
					ИскомаяПодстрока = Сред(
						СтрокаТаблицы[СтрКолонок.ИмяРеферетныйПрепарат], ОткрывающаяСкобка, Символ-ОткрывающаяСкобка + 1);
					ИзмененнаяСтрока = СтрЗаменить(ИскомаяПодстрока, ";", КлючиЗапрета.ТочкаСЗапятой);
					ИзмененнаяСтрока = СтрЗаменить(ИзмененнаяСтрока, ",", КлючиЗапрета.Запятая);
					
					ТекущийРеферетныйПрепарат = СтрЗаменить(ТекущийРеферетныйПрепарат, ИскомаяПодстрока, ИзмененнаяСтрока);
					
				КонецЕсли;
				
			КонецЦикла;
			
			МассивРеферетных = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТекущийРеферетныйПрепарат, ";");
			Если МассивРеферетных.Количество() <= 1 Тогда
				МассивРеферетных = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТекущийРеферетныйПрепарат, ",");
			КонецЕсли;
			
			Если МассивРеферетных.Количество() > 1 Тогда
				Для Каждого Референтный Из МассивРеферетных Цикл
					РазобратьИЗаполнитьСтрокиПоРеферентномуПрепарату(
						ТаблицаЗагрузки, Референтный, КлючиЗапрета, НоваяСтрока.МНН, КлючСвязи);
				КонецЦикла;
			Иначе
				РазобратьИЗаполнитьСтрокиПоРеферентномуПрепарату(
					ТаблицаЗагрузки, МассивРеферетных[0], КлючиЗапрета, НоваяСтрока.МНН, КлючСвязи);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СоздатьДочернийУзел(НовыйУзел, СтрокаТЧ)
	
	ДочернийУзел = НовыйУзел.Строки.Добавить();
	ЗаполнитьЗначенияСвойств(ДочернийУзел, СтрокаТЧ,, "МНН");
	
КонецПроцедуры

Процедура ЗаполнитьТаблицуСопоставления(Параметры)
	
	Для Каждого СтрокаМНН Из Параметры.ТаблицаЗагрузки Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаМНН.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		
		НайтиИЗаполнитьАналогиПоТекущейНоменклатуре(СтрокаМНН, Параметры);
		
	КонецЦикла;
	
	Для Каждого СтрокаМНН Из Параметры.ТаблицаЗагрузки Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаМНН.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		
		ОбновитьОбратныеКлючиСвязи(СтрокаМНН, Параметры);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьОбратныеКлючиСвязи(СтрокаМНН, Параметры) Экспорт
	
	Отбор = Новый Структура();
	Отбор.Вставить("МНН", СтрокаМНН.МНН);
	
	НайденныеАналоги = Параметры.ТаблицаЗагрузки.НайтиСтроки(Отбор);
	
	Для Каждого Строка Из НайденныеАналоги Цикл
		
		Если Не ЗначениеЗаполнено(Строка.Номенклатура)
			Или Строка.Номенклатура = СтрокаМНН.Номенклатура Тогда
			Продолжить;
		КонецЕсли;
		
		Отбор = Новый Структура();
		Отбор.Вставить("Номенклатура", СтрокаМНН.Номенклатура);
		Отбор.Вставить("Аналог", Строка.Номенклатура);
		
		УжеСопоставленные = Параметры.СопоставленныеАналоги.НайтиСтроки(Отбор);
		Если УжеСопоставленные.Количество() > 0 Тогда
			
			Отбор = Новый Структура();
			Отбор.Вставить("Номенклатура", 	Строка.Номенклатура);
			Отбор.Вставить("Аналог", 		СтрокаМНН.Номенклатура);
			
			ОбратныеЗаписиПоАналогу = Параметры.СопоставленныеАналоги.НайтиСтроки(Отбор);
			Если ОбратныеЗаписиПоАналогу.Количество() > 0 Тогда
				УжеСопоставленные[0].ОбратныйКлючСвязи = ОбратныеЗаписиПоАналогу[0].КлючСвязи;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ОпределитьСочетаниеВИнформационнойБазе(Номенклатура, Аналог, НоваяСтрока)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АналогиНоменклатуры.Приоритет КАК Приоритет,
	|	АналогиНоменклатуры.ор_Коэффициент КАК ор_Коэффициент,
	|	АналогиНоменклатуры.Комментарий КАК Комментарий,
	|	ИСТИНА КАК ЕстьВБазе,
	|	АналогиНоменклатуры.Номенклатура КАК НоменклатураБазы,
	|	АналогиНоменклатуры.Аналог КАК АналогБазы
	|ИЗ
	|	РегистрСведений.АналогиНоменклатуры КАК АналогиНоменклатуры
	|ГДЕ
	|	АналогиНоменклатуры.Номенклатура = &Номенклатура
	|	И АналогиНоменклатуры.Аналог = &Аналог";
	
	Запрос.УстановитьПараметр("Аналог", 		Аналог);
	Запрос.УстановитьПараметр("Номенклатура", 	Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
	КонецЕсли;
	
КонецФункции

Процедура РазобратьИЗаполнитьСтрокиПоРеферентномуПрепарату(
		ТаблицаЗагрузки,
		РеферентныйПрепарат,
		КлючиЗапрета,
		МНН,
		КлючСвязи)
	
	РеферентныйПрепарат = СтрЗаменить(РеферентныйПрепарат, КлючиЗапрета.ТочкаСЗапятой, ";");
	РеферентныйПрепарат = СтрЗаменить(РеферентныйПрепарат, КлючиЗапрета.Запятая, ",");
	
	ЗначениеДо = СтрЗаменить(РеферентныйПрепарат, ", покрытые", " покрытые");
	ЗначениеДо = СтрЗаменить(ЗначениеДо, ", покрытых", " покрытых");
	
	ОткрывающаяСкобка = СтрНайти(ЗначениеДо, "(");
	ЗакрывающаяСкобка = СтрНайти(ЗначениеДо, ")");
	
	НаименованиеПрепарата = "";
	ЛекарственнаяФорма    = "";
	Производитель         = "";
	Страна                = "";
	
	Если ОткрывающаяСкобка > 0
		И ЗакрывающаяСкобка > 0 Тогда
		
		Значение = Сред(ЗначениеДо, ОткрывающаяСкобка + 1, ЗакрывающаяСкобка - ОткрывающаяСкобка - 1);
		
		РазделениеТочкойСЗапятой = СтрРазделить(Значение, ";");
		Если РазделениеТочкойСЗапятой.Количество() = 2 Тогда
			
			ПроизводительСтрана = СтрРазделить(РазделениеТочкойСЗапятой[1], ",");
			Если ПроизводительСтрана.Количество() = 2 Тогда
				Производитель = СокрЛП(ПроизводительСтрана[0]);
				Страна        = СокрЛП(ПроизводительСтрана[1]);
			КонецЕсли;
			
		КонецЕсли;
		
		НаименованиеПрепарата = Лев(ЗначениеДо, ОткрывающаяСкобка - 1);
		
		МассивЗначений = СтрРазделить(РазделениеТочкойСЗапятой[0], ",");
		
		ЭтоЛекарственнаяФорма = Истина;
		
		Для Каждого ЗначениеВСкобках Из МассивЗначений Цикл
			Если ЭтоЛекарственнаяФорма Тогда
				ЛекарственнаяФорма = СокрЛП(ЗначениеВСкобках);
				ЛекарственнаяФорма = СтрЗаменить(ЛекарственнаяФорма, " покрытые", ", покрытые");
				ЛекарственнаяФорма = СтрЗаменить(ЛекарственнаяФорма, " покрытых", ", покрытых");
				ЭтоЛекарственнаяФорма = Ложь;
			Иначе
				НоваяСтрока = ТаблицаЗагрузки.Добавить();
				НоваяСтрока.ТорговоеНаименование = СокрЛП(НаименованиеПрепарата);
				
				ЛекарственнаяФорма = 
					ВРег(Лев(ЛекарственнаяФорма, 1)) + Сред(ЛекарственнаяФорма, 2);
					
				НоваяСтрока.ЛекарственнаяФорма   = ЛекарственнаяФорма;
				НоваяСтрока.Дозировка            = СокрЛП(ЗначениеВСкобках);
				НоваяСтрока.Производитель        = Производитель;
				НоваяСтрока.Страна               = Страна;
				НоваяСтрока.МНН                  = МНН;
				СформироватьФормуВыпускаВСтроке(НоваяСтрока);
				
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		
		МассивЗначений = СтрРазделить(ЗначениеДо, ",");
		
		Если МассивЗначений.Количество() >= 2 Тогда
			
			НаименованиеПрепарата = СокрЛП(МассивЗначений[0]);
			ЛекарственнаяФорма    = СокрЛП(МассивЗначений[1]);
			ЛекарственнаяФорма    = СтрЗаменить(ЛекарственнаяФорма, " покрытые", ", покрытые");
			ЛекарственнаяФорма    = СтрЗаменить(ЛекарственнаяФорма, " покрытых", ", покрытых");
			
			НоваяСтрока = ТаблицаЗагрузки.Добавить();
			НоваяСтрока.ТорговоеНаименование = СокрЛП(НаименованиеПрепарата);
			
			ЛекарственнаяФорма = 
					ВРег(Лев(ЛекарственнаяФорма, 1)) + Сред(ЛекарственнаяФорма, 2);
			
			НоваяСтрока.ЛекарственнаяФорма   = ЛекарственнаяФорма;
			НоваяСтрока.МНН                  = МНН;
			
			СформироватьФормуВыпускаВСтроке(НоваяСтрока);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьКлючСвязиВСтроке(НоваяСтрока, КлючСвязи)
	
	КлючСвязи = КлючСвязи + 1;
	НоваяСтрока.КлючСвязи = КлючСвязи;
	
КонецПроцедуры

Процедура СформироватьФормуВыпускаВСтроке(НоваяСтрока)
	
	Если ЗначениеЗаполнено(НоваяСтрока.ЛекарственнаяФорма)
		И ЗначениеЗаполнено(НоваяСтрока.Дозировка) Тогда
		
		МассивФормаВыпуска = Новый Массив();
		МассивФормаВыпуска.Добавить(НоваяСтрока.ЛекарственнаяФорма);
		МассивФормаВыпуска.Добавить(НоваяСтрока.Дозировка);
		
		НоваяСтрока.ФормаВыпуска = СтрСоединить(МассивФормаВыпуска, ", ");
		
	ИначеЕсли ЗначениеЗаполнено(НоваяСтрока.ЛекарственнаяФорма) Тогда
		
		НоваяСтрока.ФормаВыпуска = НоваяСтрока.ЛекарственнаяФорма;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьФайлExcel(Знач ТабличныйДокумент, Параметры)
	
	МассивЛистов = Новый Массив();
	
	Для Каждого Лист Из Параметры.ВыбранныеЛисты Цикл
		
		Если Не Лист.Выбран Тогда
			Продолжить;
		КонецЕсли;
		
		ОбработатьЛистФайлаExcel(ТабличныйДокумент, Лист.ИмяЛиста, Параметры);
		
	КонецЦикла;
	
	// Свернем таблицу загрузки для избежания дублей.
	Параметры.ТаблицаЗагрузки.Свернуть("Номенклатура, ЛекарственнаяФорма, Дозировка, 
								|Производитель, Выбран, НомерРУ, ТорговоеНаименование, МНН, Страна, 
								|ДатаРУ, КлючСвязи, ЕстьВБазе, НоменклатураЗаполнена, ФормаВыпуска, Комментарий");
	
	КлючСвязи = 0;
	Для Каждого СтрокаЗагрузки Из Параметры.ТаблицаЗагрузки Цикл
		ЗаполнитьКлючСвязиВСтроке(СтрокаЗагрузки, КлючСвязи);
	КонецЦикла;
	
	СопоставитьСНоменклатуройПоПараметрамИзФайла(Параметры.ТаблицаЗагрузки);
	ЗаполнитьТаблицуСопоставления(Параметры);
	СформироватьДеревоДляОтображения(Параметры);
	
КонецПроцедуры

Функция ПолучитьФактическоеКоличествоСтолбцов(ТабличныйДокумент)
	
	КоличествоСтолбцов = 0;
	
	// Получим реальное количество столбцов
	Для НомерСтолбца = 1 По ТабличныйДокумент.ШиринаТаблицы Цикл
		Область = ТабличныйДокумент.Область("R" + Формат(1, "ЧГ=") + "C" + НомерСтолбца);
		Если ЗначениеЗаполнено(СокрЛП(Область.Текст)) Тогда
			КоличествоСтолбцов = КоличествоСтолбцов + 1;
		КонецЕсли;
	КонецЦикла;
	
	Возврат КоличествоСтолбцов;
	
КонецФункции

Функция СформироватьСтруктуруКолонок(ТаблицаИзExcel)
	
	СтруктураКолонок = Новый Структура();
	СтруктураКолонок.Вставить("ИмяМНН", 					Неопределено);
	СтруктураКолонок.Вставить("ИмяТорговоеНаименование", 	Неопределено);
	СтруктураКолонок.Вставить("ИмяЛекарственнаяФорма", 		Неопределено);
	СтруктураКолонок.Вставить("ИмяДозировка", 				Неопределено);
	СтруктураКолонок.Вставить("ИмяНомерРУ", 				Неопределено);
	СтруктураКолонок.Вставить("ИмяДатаРУ", 					Неопределено);
	СтруктураКолонок.Вставить("ИмяВладелецРУ_Страна", 		Неопределено);
	СтруктураКолонок.Вставить("ИмяВладелец", 				Неопределено);
	СтруктураКолонок.Вставить("ИмяСтрана", 					Неопределено);
	СтруктураКолонок.Вставить("ИмяРеферетныйПрепарат",		Неопределено);
	СтруктураКолонок.Вставить("ИмяКомментарий",				Неопределено);
	
	Для Каждого Колонка Из ТаблицаИзExcel.Колонки Цикл
		
		Если СтрНайти(НРег(Колонка.Заголовок), "мнн") > 0 Тогда
			СтруктураКолонок.ИмяМНН = Колонка.Заголовок;
		КонецЕсли;
		
		Если СтрНайти(НРег(Колонка.Заголовок), "референтны") > 0 Тогда
			СтруктураКолонок.ИмяРеферетныйПрепарат = Колонка.Заголовок;
		КонецЕсли;
		
		Если СтрНайти(НРег(Колонка.Заголовок), "торговоенаименование") > 0
			Или СтрНайти(НРег(Колонка.Заголовок), "торговое") Тогда
			СтруктураКолонок.ИмяТорговоеНаименование = Колонка.Заголовок;
		КонецЕсли;
		
		Если СтрНайти(НРег(Колонка.Заголовок), "лекарственнаяформа") > 0
			Или СтрНайти(НРег(Колонка.Заголовок), "лекарственная") > 0
			Или СтрНайти(НРег(Колонка.Заголовок), "лекарсвенная") > 0 Тогда
			СтруктураКолонок.ИмяЛекарственнаяФорма = Колонка.Заголовок;
		КонецЕсли;
		
		Если СтрНайти(НРег(Колонка.Заголовок), "дозировка") > 0 Тогда
			СтруктураКолонок.ИмяДозировка = Колонка.Заголовок;
		КонецЕсли;
		
		Если СтрНайти(НРег(Колонка.Заголовок), "номерру") > 0
			Или СтрНайти(НРег(Колонка.Заголовок), "_ру") > 0 Тогда
			СтруктураКолонок.ИмяНомерРУ = Колонка.Заголовок;
		КонецЕсли;
		
		Если СтрНайти(НРег(Колонка.Заголовок), "датару") > 0 Тогда
			СтруктураКолонок.ИмяДатаРУ = Колонка.Заголовок;
		КонецЕсли;
		
		Если СтрНайти(НРег(Колонка.Заголовок), "ИсключениеОтдельныхГруппПациентов") > 0
			Или СтрНайти(НРег(Колонка.Заголовок), "исключение") > 0
			Или СтрНайти(НРег(Колонка.Заголовок), "комментарий") > 0 Тогда
			СтруктураКолонок.ИмяКомментарий = Колонка.Заголовок;
		КонецЕсли;
		
		Если СтрНайти(НРег(Колонка.Заголовок), "владелецру_страна") > 0 Тогда
			СтруктураКолонок.ИмяВладелецРУ_Страна = Колонка.Заголовок;
		Иначе
			
			Если СтрНайти(НРег(Колонка.Заголовок), "владелецру") > 0 Тогда
				СтруктураКолонок.ИмяВладелец = Колонка.Заголовок;
			КонецЕсли;
			Если СтрНайти(НРег(Колонка.Заголовок), "страна") > 0 Тогда
				СтруктураКолонок.ИмяСтрана = Колонка.Заголовок;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СтруктураКолонок;
	
КонецФункции

Процедура СопоставитьСНоменклатуройПоПараметрамИзФайла(ТаблицаЗагрузки) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	""%"" + ТаблицаЗагрузки.ТорговоеНаименование + ""%"" КАК ТорговоеНаименование,
	|	""%"" + ТаблицаЗагрузки.Производитель + ""%"" КАК Производитель,
	|	""%"" + ТаблицаЗагрузки.Страна + ""%"" КАК Страна,
	|	ТаблицаЗагрузки.МНН КАК МНН,
	|	ТаблицаЗагрузки.ФормаВыпуска КАК ФормаВыпуска,
	|	ТаблицаЗагрузки.НомерРУ КАК НомерРУ,
	|	ТаблицаЗагрузки.КлючСвязи КАК КлючСвязи
	|ПОМЕСТИТЬ ТаблицаЗагрузки
	|ИЗ
	|	&ТаблицаЗагрузки КАК ТаблицаЗагрузки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЗагрузки.КлючСвязи КАК КлючСвязи,
	|	СпрНоменклатура.Ссылка КАК Ссылка
	|ИЗ
	|	ТаблицаЗагрузки КАК ТаблицаЗагрузки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО (СпрНоменклатура.Наименование ПОДОБНО ТаблицаЗагрузки.ТорговоеНаименование)
	|			И (СпрНоменклатура.ор_МНН.Наименование ПОДОБНО ТаблицаЗагрузки.МНН)
	|			И (СпрНоменклатура.ор_ФормаВыпуска.Наименование = ТаблицаЗагрузки.ФормаВыпуска)
	|			И (СпрНоменклатура.ор_Производитель.Наименование ПОДОБНО ТаблицаЗагрузки.Производитель)
	|			И (СпрНоменклатура.СтранаПроисхождения.Наименование ПОДОБНО ТаблицаЗагрузки.Страна)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ТаблицаЗагрузки.КлючСвязи,
	|	НоменклатураДополнительныеРеквизиты.Ссылка
	|ИЗ
	|	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаЗагрузки КАК ТаблицаЗагрузки
	|		ПО (НоменклатураДополнительныеРеквизиты.Значение ПОДОБНО ТаблицаЗагрузки.НомерРУ)
	|			И (НоменклатураДополнительныеРеквизиты.Ссылка.ор_ФормаВыпуска.Наименование ПОДОБНО ТаблицаЗагрузки.ФормаВыпуска)
	|ГДЕ
	|	НоменклатураДополнительныеРеквизиты.Свойство.ИдентификаторДляФормул = ""НомерРУ""";
	
	Запрос.УстановитьПараметр("ТаблицаЗагрузки", ТаблицаЗагрузки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ПараметрыОтбора = Новый Структура();
		ПараметрыОтбора.Вставить("КлючСвязи", ВыборкаДетальныеЗаписи.КлючСвязи);
		
		СтрокиСопоставления = ТаблицаЗагрузки.НайтиСтроки(ПараметрыОтбора);
		Для Каждого Строка Из СтрокиСопоставления Цикл
			Строка.Номенклатура = ВыборкаДетальныеЗаписи.Ссылка;
			Строка.НоменклатураЗаполнена = Истина;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
